Assessments/Practice/alex_crooks_rails_olympics_production_A_skeleton 3/build_rails_project/BlogApp/app/views/blogs/new.html.erb

    </label>
        <input type="hidden" name ="blog[author_id]" value=<%= User.last.id %>>
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]