Assessments/Practice/alex_crooks_rails_olympics_production_A_skeleton 3/build_rails_project/BlogApp/app/views/blogs/show.html.erb

<h5>Comments:</h5>
<ul><%@blog.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 1]]

    </label>
        <input type="hidden" name ="comment[author_id]" value=<%= User.last.id %>>
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]