Assessments/Practice/alex_crooks_rails_olympics_production_A_skeleton 3/build_rails_project/BlogApp/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asddsaads"], ["author_id", 1], ["blog_id", 1], ["created_at", "2019-09-20 23:06:30.115347"], ["updated_at", "2019-09-20 23:06:30.115347"]]
---
    def create
        comment = Comment.new(new_comment_params)
        comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 7]]
---
    def destroy
        comment = Comment.find_by(id: params[:id])
        comment.delete