Classwork/w7/w7d5/redditclone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
    <br>
        <% Sub.all.each do |sub| %>