Classwork/w6/w6d3/art_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index
    artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "self portrait"], ["image_url", "selfportrat1.com"], ["artist_id", 13], ["created_at", "2021-08-12 17:27:55.718702"], ["updated_at", "2021-08-12 17:27:55.718702"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    artwork = Artwork.find_by(id: params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "instagram.com/al"], ["updated_at", "2021-08-12 17:30:57.460640"], ["id", 7]]
---
  def update
    artwork = Artwork.find_by(id: params[:id])
    if artwork.nil?
      render json: { error: 'There is no artwork with that id.' }, status: 404
      return
    end

    if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]
---
  def destroy
    artwork = Artwork.find_by(id: params[:id])
    if artwork
      artwork.destroy