Classwork/w6/w6d3/art_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!"

    users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "van_gough"], ["created_at", "2021-08-12 16:56:18.948498"], ["updated_at", "2021-08-12 16:56:18.948498"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "vangough"], ["updated_at", "2021-08-12 16:57:48.534710"], ["id", 5]]
---
  def update
    user = User.find_by(id: params[:id])
    if user.nil?
      render json: { error: 'There is no user with that id.' }, status: 404
      return
    end

    if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
  def destroy
    user = User.find_by(id: params[:id])
    if user
      user.destroy