Classwork/w7/w7d5/redditclone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_param)
        @post.author_id = current_user.id
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def show
        @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]