Classwork/w7/w7d5/redditclone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sub = Sub.find_by(id: params[:id])

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "programing humor"], ["description", "funny code humor"], ["moderator_id", 3], ["created_at", "2021-08-20 21:38:08.082058"], ["updated_at", "2021-08-20 21:38:08.082058"]]
---
    def create
        @sub = Sub.new(sub_param)
        @sub.moderator_id = current_user.id
        if @sub.save