Classwork/w7/w7d5/redditclone/app/controllers/users_controller.rb

    def create
        @user = User.new(user_param)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)