Classwork/w7/w7d5/redditclone/app/models/user.rb

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "OWlF7xIipSSCBT8dqnLiQg"], ["updated_at", "2021-08-20 19:36:37.433837"], ["id", 3]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!