Classwork/w6/w6d5/ninety_nine_cats/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        @cat = Cat.new(params.require(:cat).permit(:name, :color, :sex, :birth_date, :description))

        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]